<template>
 <div class="mainAgree">
   <el-row>
    <el-col :span="12" class="header"> </el-col>
    <el-col :span="5" class="headerOther">
      <el-button type="text" icon="el-icon-back" @click="goBack">返回</el-button>
    </el-col>
   </el-row>
  <div class="title">
    <h1>点链科技平台 注册服务协议</h1>
  </div>
  <div class="agreeTitle">
    <p>点链科技平台网站（以下简称“本网站”）
    由深圳点链科技有限公司(以下简称“本公司”)负责运营。本注册服务协议（以下简称“本协议”） 
    双方为本网站用户与本公司，适用于用户注册使用本网站服务的全部活动。</p>
  </div>
  <div class="agreeTitle">
    <h4>第一条 本站服务条款的确认</h4>
    <p>1.1 本网站各项电子服务的所有权和运作权归深圳点链科技公司。您在申请注册流程中点击“免费注册”之前，
      应当认真阅读本协议。请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、法律适用
      和争议解决条款。免除或者限制责任的条款将以粗体下划线标识，您应重点阅读。如您对协议有任何疑问，可
      向本网站客服咨询。如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</p>
    <P>1.2 您完成注册后或以任何方式进入本网站并使用本网站服务即表示您已充分阅读、理解并同意接受本协议
      的条款和条件(以下合称“条款”)，并与本公司达成一致，成为本网站“用户”。
      用户必须为符合中华人民共和国法律规定的，能够独立承担法律责任且为真实 有效的工商注册企业或公司。</P>
   <h4>第二条 接受条款</h4>
    <p>2.1 本协议内容包括协议正文及所有本网站已经发布或将来可能发布的各类规则。所有规则为协议不可分割的
      一部分，与协议正文具有同等法律效力。</p>
    <P>2.2 本网站提醒您认真阅读本协议、充分理解各条款内容后再选择是否接受本协议。除非您接受本协议所有条款
      ，否则无权使用本网站于本协议下所提供的服务。您一经注册或使用本网站提供的服务即视为充分理解并完全接
      受本协议全部条款。</P>
    <P>2.3 本公司有权根据业务需要酌情修订本协议的条款，并以网站公告的形式进行更新，不再作用户单独通知。经
      修订的“条款”一经在本网站公布，即产生效力。如您不同意相关修订，请您立即停止使用“服务”。如您继续使用
      “服务”，则将视为您已接受经修订的“条款”，并应遵照修改后的协议履行应尽义务。</P>
    <h4>第三条 注册用户</h4>
    <p>3.1 您保证在注册账号时，承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德
      风尚和信息真实性等。保证在注册和使用帐号时，在账号名称、头像和简介等注册信息中不得出现违法、不良信息
      或侵犯第三方知识产权，按照《互联网用户账号名称管理规定》，账号名称不得有下列情形：</p>
    <P>  （一）违反宪法或法律法规规定的；（二）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
      （三）损害国家荣誉和利益的，损害公共利益的；（四）煽动民族仇恨、民族歧视，破坏民族团结的；（五）
      破坏国家宗教政策，宣扬邪教和封建迷信的；（六）散布谣言，扰乱社会秩序，破坏社会稳定的；（七）散布淫秽
      、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；（八）侮辱或者诽谤他人，侵害他人合法权益的；（九）含有
      法律、行政法规禁止的其他内容的。</P>
    <P>您保证您在注册和使用账号时，按照相关规定，提供真实有效的信息；如您不提供或提供的信息不真实有效，本公
      司有权拒绝为您提供相关服务；如您的信息存在违法、不良信息的或侵犯第三方知识产权的，本公司有权采取限期改
      正、暂停使用、注销登记等措施。</P>
    <P>3.2 您可以使用您的注册用户名、或您提供或确认的邮箱、手机号码或者本公司允许的其它方式作为登录手段进入本网站。</P>
    <P>在完成注册或激活流程时，您应当按照法律法规要求，按相应页面的提示，准确提供并及时更新您的资料，以使之真实、
      及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，本公司有权向您发出询问或要求改正的
      通知，并有权直接做出屏蔽、删除相应资料的处理，直至终止对您提供部分或全部本网站的相关服务，本公司对此不承担任
      何责任，您将承担因此产生的任何直接或间接损失及不利后果。</P>
    <h4>第四条 账户与安全</h4>
    <p>4.1 成功注册为本网站用户后，用户应当妥善保管自己的用户名和密码，不得将用户名或账户转让、赠与或授权给第三方使
      用，因密码被遗忘、被第三方破解，使用的计算机被入侵等原因造成的交易风险均由用户自行承担。用户在此确认使用其用
      户的 用户名和密码登录本网站及由用户在本网站的用户账户下发出的一切指令均视为用户的行为和真实意思表示，该等指令
      不可逆转，由此产生的一切责任和后果由用户承担，本公司、本网站不承担任何责任。您同意：</p>
    <P>(a) 如发现任何人未经授权使用您的账户或密码，或发生违反保密规定的任何其他情况，您会立即通知本公司，并授权本公司
      将该信息同步给本网站；</P>
    <P>(b) 确保您在每个上网时段结束时，以正确步骤离开网站。本公司不能也不会对因您未能遵守本款规定而发生的任何损失或损
      毁负责。您理解本公司对您的请求采取行动需要合理时间，本公司对在采取行动前已经产生的后果（包括但不限于您的任何损
      失）不承担任何责任。</P>
    <P>4.2 本网站用户在线寻求信息、磋商谈判、获取交易相关服务的虚拟地点。由于交易本身和互联网的特性，本公司无法控制交
      易对象、货物信息的合法性与真实性，请您在使用本网站提供的在线交易服务与第三方进行交易时小心谨慎，并意识到在交易
      中存在着包括欺诈、亏损在内的商业风险，本网站保留因用户被投诉虚假交易而暂停或停止提供服务的权利。</P>
    <h4>第五条 风险提示</h4>
    <p>5.1 用户了解并认可，通过本网站进行的交易并不能规避所有风险。本网站无义务为交易后产生的风险承担责任。</p>
    <p>5.2 本网站不对任何用户的任何交易提供任何明示或默认的保证。用户应知悉交易存在的风险，并在独立判断后作
      出交易决策，交易产生的风险由用户自行承担。</p>
    <p>5.3 本网站不能对用户发布的信息进行控制，本网站没有义务为该信息承担证明义务。本网站不能完全保证平台内容
      的真实性、准确性和完整性，所有信息仅为参考，但网站会尽力控制各项信息的准确和真实性，用户也有义务及时发
      现并反馈给本网站。</p>
    <h4>第六条 服务费</h4>
    <p>  用户注册使用本网站提供的服务，本公司有权向用户收取服务费用，具体服务费用以本网站公告或具体签署的电子协议为准。
      用户承诺按照相关具体的电子协议或其他形式的约定向本网站支付服务费用，并同意本网站有权自其有关账户中直接扣划服务
      费用，若遇延期支付的的本网站保留暂停使用相关账户的权利。若用户通过本网站与其他方签订协议的，用户按照签署的协议
      约定向其他方支付费用。</p>
    <h4>第七条 通知</h4>
    <p>7.1 您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便本公司或其他用户
      与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用本网站的服务过程中产生任何损失或增加费用的，应
      由您完全独自承担。您了解并同意，您有义务保持你提供的联系方式的有效性，如有变更需要更新的，您应按本公司的要求进行操作。</p>
    <p>7.2 除非另有明确规定，任何您与本公司之间的通知以电子邮件形式发送，发送到您在登记注册过程中向本公司提供的电子邮件地址，
      或有关方指明的该等其他地址。在电子邮件发出二十四(24)小时后，通知应被视为已送达，除非发送人被告知相关电子邮件地址已作废。
    </p>
    <h4>第八条 用户守法承诺</h4>
    <p>8.1 用户不得利用本网站从事任何违法违规活动，用户在此承诺合法使用本网站提供的服务，遵守中国现行法律、法规、规章、规范性
      文件的规定。若用户违反上述规定，所产生的一切法律责任和后果与本公司、本网站无关，由用户自行承担，如因此给本公司、本网站
      造成损失的，由用户赔偿本公司、本网站的损失。本公司保留将用户违法违规行为及有关信息资料进行公示、计入用户信用档案、按照
      法律 法规的规定提供给有关政府部门或按照有关协议约定提供给第三方的权利。
    </p>
    <p>8.2 如用户在本网站的某些行为或言论不合法、违反有关协议约定、侵犯本公司的利益等，本公司有权基于独立判断直接删除用户在本
      网站上作出的上述行为或言论，有权中止、终止、限制用户使用本网站服务，而无需通知用户，亦无需承担任何责任。如用户因此而给
      本公司及本网站造成损失的，应当赔偿本公司及本网站的损失。</p>
    <h4>第九条 不保证条款</h4>
    <p>9.1 本网站提供的服务中不含有任何明示、暗示的，对任何用户、任何交易的真实性、 准确性、可靠性、有效性、完整性等的任何保
      证和承诺，用户需根据自身风险承受能力，衡量本网站披露的交易内容及交易对方的真实性、可靠性、有效性、完整性，用户因其选择
      使用本网站提供的服务、参与的交易等而产生的直接或间接损失 均由用户自己承担，包括但不限于资金损失、利润损失、营业中断等。
      本公司及其股东、创始人、全体员工、代理人、关联公司、子公司、分公司均不对以上损失承担任何责任。</p>
    <p>9.2 基于互联网的特殊性，本公司无法保证本网站的服务不会中断，对于包括但不 限于本公司、本网站及相关第三方的设备、系统存
      在缺陷，计算机发生故障、遭到病毒、黑客攻击或者发生地震、海啸等不可抗力而造成服务中断或因此给用户造成的损失，本公司不承
      担任何责任，有关损失由用户自己承担。</p>
    <h4>第十条 责任范围</h4>
    <p>10.1 用户需根据自身风险承受能力及本网站发布信息的可靠程度独立判断，做出交易决策。交易后产生的任何损失均由用户自行承担。</p>
    <P>10.2 与本公司合作的第三方机构向用户提供的服务由第三方机构自行负责，本公司不对此等服务承担任何责任。</P>
    <p>10.3 本网站的内容可能涉及第三方的信息或第三方网站，该等信息或第三方网站的真实性、可靠性、有效性等由相关第三方负责，用户
      对该等信息或第三方网站自行判断并承担风险，与本网站、本公司无关。</p>
    <p>10.4 无论如何，本公司对用户承担的违约赔偿（如有）总额不超过向用户收取的服务费用总额。</p>
    <p>10.5 用户由本网站任何工作人员处取得的建议、说明均不构成本网站对服务的承诺和保证。由此产生的法律后果，本网站不承担任何责任。</p>
    <h4>第十一条 用户资料的使用与披露</h4>
    <P>11.1 若经过用户同意，本网站可从公开及私人资料中收集用户的额外信息，以更好地掌握用户的实际情况，为用户量身订做合适的服务。</P>
    <P>11.2 本网站对于用户提供的、本公司自行收集的及其他用户自身信息享有使用和披露的权利。本公司基于履行协议、提供服务、解决争议、
      保障交易安全等目的使用 用户自身信息资料时，无需告知用户。</P>
    <P>11.3 用户在此同意：对于用户在本网站注册之后进行任何违法、违规及违反本网站管理规定的行为，本网站均有权在本网站或委托第三方机
      构进行发布与披露，本网站对发布与披露方式、内容均不承担任何责任。</P>
    <P>11.4 用户授权本公司基于履行有关协议、解决争议、调停纠纷、保障本网站用户交易安全的目的等使用用户的自身资料（包括但不限于用户自行
      提供的以及本公司信审行为所获取的其他资料）。本公司有权调查多个用户以识别问题或解决争议，特别是本公司可审查用户的资料以区分使用多
      个用户名或别名的用户。</P>
    <P>11.5 为避免恶意用户通过本网站从事欺诈、非法或其他刑事犯罪活动，保护本网站 的正常用户合法权益，用户授权本公司可通过人工或自动程序
      对用户的自身资料进行评价和衡量。</P>
    <P>11.6 本网站采用行业标准和惯例保护用户的自身信息。本网站不会将用户信息恶意出售或免费共享给任何第三方。鉴于技术限制，本网站无法确保
      用户的自身信息完全不被泄露。</P>
    <P>11.7 本网站有义务根据有关法律要求向司法机关和政府部门提供用户的自身资料。</P>
    <P>11.8 若用户未能按照其与本公司及本网站其他用户签订的协议等法律文本的约定履行应尽义务，本公司有权披露用户自身信息及违约事实。本网站
      有权将上述信息写入网站黑名单，且与任何第三方进行数据共享，以供网站及第三方审核、催收之用。由此给用户造成的任何损失，本网站不承担法律责任。</P>
    <h4>第十二条 保密条款</h4>
    <P>双方承诺在本协议执行过程中，对本协议内容及获悉的对方的商业秘密不得向第三方透露，否则应承担对方因此而致的损失。</P>
    <h4>第十三条 知识产权条款</h4>
    <P>13.1 本网站中的所有内容均属于本公司所有，包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片、音频、视频及其他全部信息。本网站
      内容受中国知识产权法律法规及各国际版权公约的保护。</P>
    <P>13.2 未经本公司事先书面同意，用户承诺不以任何形式复制、模仿、传播、出版、公布、展示本网站内容，包括但不限于电子的、机械的、复印的、录音
      录像的方式和形式等。用户承认本网站内容是属于本公司的财产。</P>
    <P>13.3 未经本公司书面同意，用户不得将本网站包含的资料等任何内容发布到任何其他网站或者服务器。任何未经授权对本网站内容的使用均属于违法行为，
      本公司有权追究用户的法律责任。</P>
  </div>
  </div>
</template>
<script>
export default {
   methods:{
     toSccp(){
       window.open('https://sccp.dianliantech.com')
     },
     goBack(){
       this.$router.push('/register')
     }
   }
}
</script>
<style scoped lang="scss">
.mainAgree{
  width: 100%;
  height: 100%;
  overflow: auto;
  }
.title{
  text-align: center
}
.agreeTitle{
  margin:0 auto;
  font-size: 18px;
  width: 60%;
  overflow: hidden;
}
.header {
  height: 100px;
  line-height: 60px;
  color:#fff;
  background-image: url('../assets/images/bg_title.png');
  background-repeat:no-repeat;
  background-position: 50%;
}
.headerOther{
  height: 100px;
  line-height: 160px;
  margin-left: 25%;
}
.back{
  // line-height: 60px;
  color:#fff;
  background-image: url('../assets/images/fanhui.png');
  background-repeat:no-repeat;
  background-size: 10% 100%;
}
::-webkit-scrollbar{
    display:none;
}
</style>
